<a href="https://colab.research.google.com/github/Void-Brain70/Pandas/blob/main/Reading_Writing_CSV_EXCEL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Read and Write CSV File

In [1]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [2]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv", skiprows=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [3]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv",header=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [6]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv", header=None,names=["tickers","eps","revenue","price","people"])
df

   tickers            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [7]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv",nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [10]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv", na_values=['not available',"n.a."])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [12]:
import pandas as pd
df = pd.read_csv("/content/stock_data.csv",na_values={
    'eps':['not available',"n.a."],
    'revenue':['not available',"n.a.",-1],
    'people':['not available',"n.a."]
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [17]:
df.to_csv('new.csv',index=False)
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [19]:
df.to_csv('new.csv',columns=['tickers', 'eps'])

In [20]:
df.to_csv('new.csv',header=False)

Read and Write Excel File

In [22]:
import pandas as pd
df = pd.read_excel("/content/stock_data.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [24]:
import pandas as pd

def Convert(cell):
  if cell == "n.a.":
    return 'sam walton'
  return cell  
df = pd.read_excel("/content/stock_data.xlsx","Sheet1",converters={
    'people': Convert
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [26]:
import pandas as pd

def Convert_p(cell):
  if cell == "n.a.":
    return 'sam walton'
  return cell 

def Convert_eps(cell):
  if cell == "not available":
    return None
  return cell  

df = pd.read_excel("/content/stock_data.xlsx","Sheet1",converters={
    'people': Convert_p,
    'eps': Convert_eps
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [27]:
df.to_excel('new.xlsx',sheet_name='stocks')

In [28]:
df.to_excel('new.xlsx',sheet_name='stocks',startrow=1,startcol=2)

In [30]:
import pandas as pd

info1 = pd.DataFrame({
    'Name':['Anik Chandra','Abdul Rab Anik','Anisul islam'],
    'ID':['18101070','18101073','18101079'],
    'Cgpa':['3.67','3.48','3.46']
})

info2 = pd.DataFrame({
    "City":["Narayanganj","Dhaka","Cumilla"],
    "School":["DMHS","PLS","CGS"],
    "College":["GSC","PLSC","DIC"]
})

with pd.ExcelWriter("Student_Info.xlsx") as writer:
  info1.to_excel(writer,sheet_name='info1')
  info2.to_excel(writer,sheet_name='info2')